tikets/app/controllers/tikets_controller.rb

SELECT * FROM "tikets"
---
  def index
    @tikets = Tiket.all

SELECT * FROM "tikets" WHERE ("tikets"."id" = 1)
---
  def show
    @tiket = Tiket.find(params[:id])

INSERT INTO "tikets" ("name", "updated_at", "seat_id", "price_paid", "phone", "address", "email_address", "created_at") VALUES('Amir', '2009-08-02 15:36:04', '6B', 15.0, '01930000000', 'Cheras', 'amir@yahoo.com', '2009-08-02 15:36:04')
---
  def create
    @tiket = Tiket.new(params[:tiket])

    respond_to do |format|
      if @tiket.save